Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 512, 352, 3)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 512, 352, 32)      896       
_________________________________________________________________
batch_normalization (BatchNo (None, 512, 352, 32)      128       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 512, 352, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 512, 352, 32)      9248      
_________________________________________________________________
batch_normalization_1 (Batch (None, 512, 352, 32)      128       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 512, 352, 32)      0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 256, 176, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 256, 176, 64)      18496     
_________________________________________________________________
batch_normalization_2 (Batch (None, 256, 176, 64)      256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 256, 176, 64)      0         
_________________________________________________________________
dropout (Dropout)            (None, 256, 176, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 256, 176, 64)      36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 256, 176, 64)      256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 256, 176, 64)      0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256, 176, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 88, 128)      73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 128, 88, 128)      512       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 128, 88, 128)      0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128, 88, 128)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 88, 128)      147584    
_________________________________________________________________
batch_normalization_5 (Batch (None, 128, 88, 128)      512       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 128, 88, 128)      0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 128, 88, 128)      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 88, 128)      147584    
_________________________________________________________________
batch_normalization_6 (Batch (None, 128, 88, 128)      512       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 128, 88, 128)      0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 128, 88, 128)      0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 44, 256)       295168    
_________________________________________________________________
batch_normalization_7 (Batch (None, 64, 44, 256)       1024      
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 64, 44, 256)       0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 64, 44, 256)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 64, 44, 256)       590080    
_________________________________________________________________
batch_normalization_8 (Batch (None, 64, 44, 256)       1024      
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 64, 44, 256)       0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 64, 44, 256)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 64, 44, 256)       590080    
_________________________________________________________________
batch_normalization_9 (Batch (None, 64, 44, 256)       1024      
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 64, 44, 256)       0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 64, 44, 256)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 22, 512)       1180160   
_________________________________________________________________
batch_normalization_10 (Batc (None, 32, 22, 512)       2048      
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 32, 22, 512)       0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 32, 22, 512)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 32, 22, 512)       2359808   
_________________________________________________________________
batch_normalization_11 (Batc (None, 32, 22, 512)       2048      
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 32, 22, 512)       0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 32, 22, 512)       0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 32, 22, 512)       2359808   
_________________________________________________________________
batch_normalization_12 (Batc (None, 32, 22, 512)       2048      
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 32, 22, 512)       0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 32, 22, 512)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 16, 11, 1024)      4719616   
_________________________________________________________________
batch_normalization_13 (Batc (None, 16, 11, 1024)      4096      
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 16, 11, 1024)      0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 16, 11, 1024)      0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 8, 5, 1024)        0         
_________________________________________________________________
flatten (Flatten)            (None, 40960)             0         
_________________________________________________________________
dense (Dense)                (None, 128)               5243008   
_________________________________________________________________
dropout_12 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 516       
=================================================================
Total params: 17,788,452
Trainable params: 17,780,644
Non-trainable params: 7,808
_________________________________________________________________
